OpenFOAM_6/tutorials/incompressible/pimpleFoam/laminar/planarContraction/system/graphs
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/


// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

type            sets;
libs            ("libsampling.so");

writeControl    writeTime;

interpolationScheme cellPoint;

setFormat   raw;

setConfig
{
    type    lineCell;
    axis    distance;  // x, y, z, xyz
}

sets
(
    lineA
    {
        $setConfig;
        start (-0.0016 0      0);
        end   (-0.0016 0.0128 0);
    }

    lineB
    {
        $setConfig;
        start (-0.0048 0      0);
        end   (-0.0048 0.0128 0);
    }

    lineC
    {
        $setConfig;
        start (-0.032 0      0);
        end   (-0.032 0.0128 0);
    }
);

fields  (U);

// ************************************************************************* //
